Repository: blairdrummond/bilingual_docs_example
Catalog: docs/locales/*/LC_MESSAGES/features.po
Languages: fr

source: reStructuredText & Sphinx features
fr: Les caractéristiques de reStructuredText et Sphinx

source: Here are some highlights of features that are likely to be useful to data scientists and managers alike.
fr: Voici quelques points forts des fonctionnalités susceptibles d'être utiles aux scientifiques et aux gestionnaires de données.

source: Basic text editing
fr: Traitement de texte de base

source: Common text formatting is easy to implement through ``*`` and ````` characters::
fr: Le formatage de texte commun est facile à mettre en œuvre grâce aux caractères ``*`` et `````::

source: Mark *italic text* with one asterisk, **bold text** with two. For ``monospaced text``, use two "backquotes" instead.
fr: Marquez *texte italique* avec un astérisque, **texte gras** avec deux. Pour le ``texte à simple interligne``, utilisez plutôt deux "apostrophes".

source: Escaping text elements
fr: Éléments de texte échappés

source: If you want to literally insert the ``*`` or ````` characters, you can escape them by including a backslash::
fr: Si vous voulez insérer littéralement les caractères ``*`` ou `````, vous pouvez les échapper en incluant une barre oblique inversée::

source: Lists
fr: Listes

source: You can create ordered and unordered lists easily by starting a line with ``*``, ``-``, or ``+``. Numbered lists start like ``1.``::
fr: Vous pouvez créer facilement des listes ordonnées et non ordonnées en commençant une ligne par ``*``, ``-``, or ``+``. Les listes numérotées commencent comme suit ``1.``::

source: This will create
fr: Cela créera

source: an unordered list
fr: une liste non ordonnée

source: even multiple levels
fr: même à plusieurs niveaux

source: are possible
fr: sont possibles

source: This is an
fr: Voici une

source: ordered one
fr: liste ordonnée

source: Use ``.. hlist::`` to create a list that spreads its terms over horizontal columns.
fr: Utilisez ``.. hlist::`` pour créer une liste qui répartit ses termes sur des colonnes horizontales.

source: A list of
fr: Une liste

source: short items
fr: d'articles courts

source: that should be
fr: qui doivent être

source: displayed
fr: affichés

source: horizontally
fr: horizontalement

source: Code and console markup
fr: Code et balisage de la console

source: Generic code sections are denoted by ending a paragraph with ``::`` characters and then indenting whatever you want to be highlighted as code::
fr: Les sections de code générique sont désignées en terminant un paragraphe par les caractères ``::`` et en mettant en retrait ce que vous voulez mettre en évidence comme code::

source: De-indenting then returns you to "normal" text. If you don't have any descriptive text for some reason, you can just put the ``::`` on a line by itself.
fr: La suppression du retrait vous ramène alors au texte "normal". Si vous n'avez pas de texte descriptif pour une raison quelconque, vous pouvez simplement mettre le ``::`` sur une ligne à part.

source: Importing docstrings
fr: Importer des docstring

source: You can import documentation from modules automatically::
fr: Vous pouvez importer automatiquement la documentation des modules::

source: Download an image masked by a polygon geometry.
fr: Téléchargez une image masquée par une géométrie de polygone.

source: Parameters
fr: Paramètres

source: URL to the GeoTIFF
fr: URL du GeoTIFF

source: Geometry used to mask (clip) the image as a GeoJSON-like dict
fr: Géométrie utilisée pour masquer (clip) l'image comme un dict de type GeoJSON

source: Returns
fr: Rendre

source: A masked image and the transform that was applied to it, along with the image metadata
fr: Une image masquée et la transformation qui lui a été appliquée, ainsi que les métadonnées de l'image

source: Hard line breaks and quotes
fr: Ruptures de ligne et citations

source: You can force newlines for text by starting the line with the ``|`` character::
fr: Vous pouvez forcer les nouvelles lignes du texte en commençant la ligne par le caractère ``|``.::

source: Quotes are denoted using blank spaces at the beginning of a line to inset the text.
fr: Les citations sont indiquées en utilisant des espaces vides au début d'une ligne pour insérer le texte.

source: Mathematic notation
fr: Notation mathématique

source: or
fr: ou

source: Multi-line exquations are possible as well::
fr: Des exquations multi-lignes sont également possibles::

source: Markdown doesn't support tables, though they are possible through extensions like :abbr:`GFM (GitLab Flavoured Markdown)`. You can generate tables in two different ways: (1) grid tables or (2) simple tables::
fr: La démarque ne supporte pas les tableaux, bien qu'ils soient possibles grâce à des extensions comme :abbr:`GFM (GitLab Flavoured Markdown)`.Vous pouvez générer des tableaux de deux manières différentes : (1) tableaux quadrillés ou (2) tableaux simples::

source: Table Headings
fr: Titres des tables

source: Here
fr: Ici

source: Sub
fr: sous

source: Headings
fr: titres

source: Too
fr: aussi

source: cell spans rows
fr: la cellule s'étend sur les lignes

source: column spanning
fr: colonne couvrant

source: normal
fr: normale

source: cell
fr: colonne

source: multi line cells too
fr: les colonnes multi-lignes aussi

source: cells can be
fr: colonnes peut-être

source: formatted
fr: format

source: no
fr: pas

source: row
fr: de

source: spans
fr: rangée

source: Definition lists
fr: Listes de définitions

source: Creating definition lists are relatively simple, and will end up creating terms for the glossary.
fr: La création de listes de définitions est relativement simple, et finira par créer des termes pour le glossaire.

source: term
fr: terme

source: word, expression, phrase, turn of phrase, idiom, locution; name, title, denomination, designation, label; formal appellation.
fr: mot, expression, phrase, expression tournante, idiome, locution ; nom, titre, dénomination, désignation, étiquette ; appellation formelle.

source: Comments
fr: Commentaires

source: There is no support for comments in Markdown, which means any discussions around the content or hints need to take place outside of the content itself. This makes maintenance more difficult, and can lead to miscommunication between content maintainers.
fr: Le système de notation ne prend pas en charge les commentaires, ce qui signifie que toute discussion sur le contenu ou les indices doit se dérouler en dehors du contenu lui-même. Cela rend la maintenance plus difficile et peut conduire à une mauvaise communication entre les responsables de la maintenance du contenu.

source: You can create comments by creating a line with just two dots at the start::
fr: Vous pouvez créer des commentaires en créant une ligne avec seulement deux points au début::

source: Other features
fr: Autres fonctionnalités

source: reStructuredText and Sphinx have many more language features that you can explore in the `documentation <https://www.sphinx-doc.org/en/master/usage/restructuredtext/index.html>`_.
fr: reStructuredText et Sphinx ont de nombreuses autres caractéristiques linguistiques que vous pouvez explorer dans la `documentation <https://www.sphinx-doc.org/en/master/usage/restructuredtext/index.html>`_.
